### CoVariance,Pearson & Spearman Rank Correlation coefficients,pandas profiling & sweetviz

In [1]:
import pandas as pd
import numpy as np

In [3]:
df=pd.read_csv('../../Titanic-survival-prediction/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
df['Age'].fillna(df['Age'].median(),inplace=True)
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

#### Variance

In [7]:
chk=[]
age_mean=df['Age'].mean()
print(age_mean)
for val in df['Age']:
    chk.append((val-age_mean)**2)
print('Variance of Age is :',sum(chk)/df.shape[0])

29.36158249158249
Variance of Age is : 169.32224856193795

#### Covariance

In [13]:
chk=[]
age_mean=df['Age'].mean()
age_fare=df['Fare'].mean()
print(age_mean)
print(age_fare)
for i in range(0,df.shape[0]):
    chk.append((df.loc[i]['Age']-age_mean)*(df.loc[i]['Fare']-age_fare))
print('Co Variance of Age & Fare is :',sum(chk)/df.shape[0])

29.36158249158249
32.2042079685746
Co Variance of Age & Fare is : 62.48655761253012

We are able to say that they are positively correlated, but not how much. We can check that using the Pearson Corelation coefficient which is in the range of -1 and 1.

#### Pearson Correlation Coefficient

In [14]:
print(df['Age'].std())
print(df['Fare'].std())

13.019696550973194
49.693428597180905

In [15]:
chk=[]
age_mean=df['Age'].mean()
age_fare=df['Fare'].mean()
print(age_mean)
print(age_fare)
std_age=df['Age'].std()
std_fare=df['Fare'].std()
print(df['Age'].std())
print(df['Fare'].std())
for i in range(0,df.shape[0]):
    chk.append((df.loc[i]['Age']-age_mean)*(df.loc[i]['Fare']-age_fare)/(std_age*std_fare))
print('Pearson Correlation Coefficient of Age & Fare is :',sum(chk)/df.shape[0])

29.36158249158249
32.2042079685746
13.019696550973194
49.693428597180905
Pearson Correlation Coefficient of Age & Fare is : 0.09657990543268767

In [16]:
df[['Age','Fare']].corr()

           Age      Fare
Age   1.000000  0.096688
Fare  0.096688  1.000000

For non linearly increasing/decreasing data , PCC is not good and hence Spearman rank correlation coeficient is used where rank is used for finding the correlation.

#### Spearman rank correlation coeficient

In [18]:
df.sort_values(by='Age',inplace=True)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S

In [20]:
df['Age_rank']=[i for i in range(1,df.shape[0]+1)]
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_rank
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C,1
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S,2
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C,3
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C,4
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S,5

In [21]:
df.sort_values(by='Fare',inplace=True)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_rank
597,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0,NaN,S,817
466,467,0,2,"Campbell, Mr. William",male,28.0,0,0,239853,0.0,NaN,S,442
481,482,0,2,"Frost, Mr. Anthony Wood ""Archie""",male,28.0,0,0,239854,0.0,NaN,S,343
413,414,0,2,"Cunningham, Mr. Alfred Fleming",male,28.0,0,0,239853,0.0,NaN,S,489
302,303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0,NaN,S,143

In [22]:
df['Fare_rank']=[i for i in range(1,df.shape[0]+1)]
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_rank,Fare_rank
597,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0,NaN,S,817,1
466,467,0,2,"Campbell, Mr. William",male,28.0,0,0,239853,0.0,NaN,S,442,2
481,482,0,2,"Frost, Mr. Anthony Wood ""Archie""",male,28.0,0,0,239854,0.0,NaN,S,343,3
413,414,0,2,"Cunningham, Mr. Alfred Fleming",male,28.0,0,0,239853,0.0,NaN,S,489,4
302,303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0,NaN,S,143,5

In [24]:
sum([(df['Age_rank']-df['Fare_rank'])**2])

597    665856
466    193600
481    115600
413    235225
302     19044
        ...
88     427716
27     553536
737     46225
679     40804
258     50625
Length: 891, dtype: int64

In [26]:
chk=[]
for i in range(0,df.shape[0]):
    chk.append((df.loc[i]['Age_rank']- df.loc[i]['Fare_rank'])**2)
print(sum(chk))

102513998

In [37]:
n=df.shape[0]
print('Spearman rank coefficient:',(1-6*(sum(chk))/(n*(n**2 -1))))

Spearman rank coefficient: 0.1304353896534075

#### Pandas Profiling

We can automate certain parts of EDA using pandas_profiling

In [38]:
df1=pd.read_csv('../../Titanic-survival-prediction/titanic.csv')
df1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [39]:
from pandas_profiling import ProfileReport
profile=ProfileReport(df1,explorative=True,title='Titanic Pandas Profiling')
profile.to_widgets()

HBox(children=(FloatProgress(value=0.0, description='Summarize dataset', max=26.0, style=ProgressStyle(descrip…

HBox(children=(FloatProgress(value=0.0, description='Generate report structure', max=1.0, style=ProgressStyle(…

C:\Users\admin\anaconda3\lib\site-packages\pandas_profiling\visualisation\plot.py:154: MatplotlibDeprecationWarning: You are modifying the state of a globally registered colormap. In future versions, you will not be able to modify a registered colormap in-place. To remove this warning, you can make a copy of the colormap first. cmap = copy.copy(mpl.cm.get_cmap("RdBu"))
  cmap.set_bad(cmap_bad)

HBox(children=(FloatProgress(value=0.0, description='Render widgets', max=1.0, style=ProgressStyle(description…

VBox(children=(Tab(children=(Tab(children=(GridBox(children=(VBox(children=(GridspecLayout(children=(HTML(valu…

In [41]:
profile.to_file('Titanic Pandas_Profiling.html')

HBox(children=(FloatProgress(value=0.0, description='Render HTML', max=1.0, style=ProgressStyle(description_wi…

HBox(children=(FloatProgress(value=0.0, description='Export report to file', max=1.0, style=ProgressStyle(desc…

#### SweetViz

If data is large and if it has large no of features pandas profiling doesnt perform good. We can use SweetViz to perform the same on the House Price Prediction Dataset - https://www.kaggle.com/c/house-prices-advanced-regression-techniques/data

In [42]:
train=pd.read_csv('train.csv')
test=pd.read_csv('test.csv')
train.head()

,Id,MSSubClass,MSZoning,LotFrontage,LotArea,Street,Alley,LotShape,LandContour,Utilities,...,PoolArea,PoolQC,Fence,MiscFeature,MiscVal,MoSold,YrSold,SaleType,SaleCondition,SalePrice
0,1,60,RL,65.0,8450,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,2,2008,WD,Normal,208500
1,2,20,RL,80.0,9600,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,5,2007,WD,Normal,181500
2,3,60,RL,68.0,11250,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,9,2008,WD,Normal,223500
3,4,70,RL,60.0,9550,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,2,2006,WD,Abnorml,140000
4,5,60,RL,84.0,14260,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,12,2008,WD,Normal,250000

In [43]:
train.shape

(1460, 81)

In [44]:
import sweetviz
report=sweetviz.analyze([train,'Train'],target_feat='SalePrice')

:FEATURES DONE:                    |█████████████████████| [100%]   01:13  -> (00:00 left)
:PAIRWISE DONE:                    |█████████████████████| [100%]   00:13  -> (00:00 left)

Creating Associations graph... DONE!

In [45]:
report.show_html('sweetviz_house_pred.html')

we can also compare to dataframes like train and test and observe the EDA of the 2 data files side by side.

In [46]:
compare1=sweetviz.compare([train,'Train'],[test,'Test'],target_feat='SalePrice')

:FEATURES DONE:                    |█████████████████████| [100%]   01:19  -> (00:00 left)
:PAIRWISE DONE:                    |█████████████████████| [100%]   00:21  -> (00:00 left)

Creating Associations graph... DONE!

In [47]:
compare1.show_html('sweetviz_house_pred_compare.html')